#include "motor.h"

//电机PWM变量

int motor = 0;
        

/**************************************************************************
函数功能：赋值给PWM寄存器
入口参数：PWM
返回  值：无
**************************************************************************/
void Set_Pwm(int motor)
{
	if(motor>0)     AIN2=0, AIN1=1;
	else 	        AIN2=1,	AIN1=0;
	PWMA=myabs(motor);
}

/**************************************************************************
函数功能：绝对值函数
入口参数：int
返回  值：unsigned int
**************************************************************************/
int myabs(int a)
{ 		   
	int temp;
	if(a<0)  
	  temp=-a;  
	else 
	  temp=a;
	return temp;
}

